STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/Core/Src/app_entry.c
  /* Stop the timer that is generating the OS tick interrupt. */
  UTIL_TIMER_Stop(&TimerOsTick_Id);

  /* Make sure the SysTick reload value does not overflow the counter. */
  if( xExpectedIdleTime > maximumPossibleSuppressedTicks )
  {
    xExpectedIdleTime = maximumPossibleSuppressedTicks;
  }

  /* Enter a critical section but don't use the taskENTER_CRITICAL()
   * method as that will mask interrupts that should exit sleep mode. */
  __asm volatile ( "cpsid i" ::: "memory" );
  __asm volatile ( "dsb" );
  __asm volatile ( "isb" );

  eSleepStatus = eTaskConfirmSleepModeStatus();

  /* If a context switch is pending or a task is waiting for the scheduler
   * to be unsuspended then abandon the low power entry. */
  if( eSleepStatus == eAbortSleep )
  {
    /* Restart the timer that is generating the OS tick interrupt. */
    UTIL_TIMER_StartWithPeriod(&TimerOsTick_Id, portTICK_PERIOD_MS);

    /* Re-enable interrupts - see comments above the cpsid instruction above. */
    __asm volatile ( "cpsie i" ::: "memory" );
  }
  else
  {
    if( eSleepStatus != eNoTasksWaitingTimeout )
    {
      /* Configure an interrupt to bring the microcontroller out of its low
         power state at the time the kernel next needs to execute. The
         interrupt must be generated from a source that remains operational
         when the microcontroller is in a low power state. */
      UTIL_TIMER_StartWithPeriod(&TimerOSwakeup_Id, (xExpectedIdleTime - 1) * portTICK_PERIOD_MS);
    }

    /* Read the current time from RTC, maintainned in standby */
    lowPowerTimeBeforeSleep = getCurrentTime();

    /* Enter the low power state. */

    LL_PWR_ClearFlag_STOP();
#if ((CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1))
    if ( ( system_startup_done != FALSE ) && ( UTIL_LPM_GetMode() == UTIL_LPM_OFFMODE ) )
    {
      APP_SYS_BLE_EnterDeepSleep();
    }
#endif /* ((CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1)) */
    LL_RCC_ClearResetFlags();

    HAL_SuspendTick();
    UTIL_LPM_EnterLowPower(); /* WFI instruction call is inside this API */
    HAL_ResumeTick();

    /* Stop the timer that may wakeup us as wakeup source can be another one */
    UTIL_TIMER_Stop(&TimerOSwakeup_Id);

    /* Determine how long the microcontroller was actually in a low power
     state for, which will be less than xExpectedIdleTime if the
     microcontroller was brought out of low power mode by an interrupt
     other than that configured by the vSetWakeTimeInterrupt() call.
     Note that the scheduler is suspended before
     portSUPPRESS_TICKS_AND_SLEEP() is called, and resumed when
     portSUPPRESS_TICKS_AND_SLEEP() returns.  Therefore no other tasks will
     execute until this function completes. */
    lowPowerTimeAfterSleep = getCurrentTime();

    /* Compute time spent in low power state and report precision loss */
    lowPowerTimeDiff = (lowPowerTimeAfterSleep - lowPowerTimeBeforeSleep) + lowPowerTimeDiffRemaining;
    /* Store precision loss during RTC time conversion to report it for next OS tick. */
    timeDiff = TIMER_IF_Convert_Tick2ms(lowPowerTimeDiff);
    lowPowerTimeDiffRemaining = lowPowerTimeDiff - TIMER_IF_Convert_ms2Tick(timeDiff);
    /* Report precision loss */
    timeDiff += timeDiffRemaining;
    /* Store precision loss during OS tick time conversion to report it for next OS tick. */
    timeDiffRemaining = timeDiff % portTICK_PERIOD_MS;

    /* Correct the kernel tick count to account for the time spent in its low power state. */
    vTaskStepTick( timeDiff / portTICK_PERIOD_MS );

    /* Re-enable interrupts to allow the interrupt that brought the MCU
     * out of sleep mode to execute immediately.  See comments above
     * the cpsid instruction above. */
    __asm volatile ( "cpsie i" ::: "memory" );
    __asm volatile ( "dsb" );
    __asm volatile ( "isb" );

    /* Put the radio in active state */
    if( system_startup_done != FALSE )
    {
      LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
      (void)ll_sys_dp_slp_exit();
    }

    /* Restart the timer that is generating the OS tick interrupt. */
    UTIL_TIMER_StartWithPeriod(&TimerOsTick_Id, portTICK_PERIOD_MS);
  }
  return;
}
#else
void vPortSuppressTicksAndSleep( uint32_t xExpectedIdleTime )
{
  return;
}
#endif /* ( CFG_LPM_LEVEL != 0) */

/**
 * @brief Function Assert AEABI in case of not described on 'libc' libraries.
 */
__WEAK void __aeabi_assert(const char * szExpression, const char * szFile, int iLine)
{
  Error_Handler();
  __builtin_unreachable();
}

#if (HAL_TICK_RTC == 1)
/* Overwrite HAL Tick functions to not use sysTick but RTC */
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{
  if(TimerHalTick_Id.Callback == NULL)
  {
    /* Create an RTC based timer to trigger HAL tick increment */
    UTIL_TIMER_Create(&TimerHalTick_Id,
                      HAL_TICK_FREQ_100HZ,
                      UTIL_TIMER_PERIODIC,
                      &TimerHalTickCb, 0);
    uwTickFreq = HAL_TICK_FREQ_100HZ;
  }
  return HAL_OK;
}

void HAL_SuspendTick(void)
{
  UTIL_TIMER_Stop(&TimerHalTick_Id);
  return;
}

void HAL_ResumeTick(void)
{
  UTIL_TIMER_Start(&TimerHalTick_Id);
  return;
}

static void HAL_StartTick(void)
{
  UTIL_TIMER_StartWithPeriod(&TimerHalTick_Id, HAL_TICK_FREQ_100HZ);
  return;
}
#endif /* HAL_TICK_RTC */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
